yemachao/hal_stm32f103zetx/HAL_F103ZETx_Release.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F1
SH.FSMC_D1_DA1.1=FSMC_D1,16b-d2
ProjectManager.MainLocation=Core/Src
FSMC.AddressSetupTime2=0x00
FSMC.AddressSetupTime1=0x01
RCC.MCOFreq_Value=72000000
VP_SYS_VS_tim6.Mode=TIM6
SH.FSMC_D1_DA1.0=FSMC_D1,16b-d1
SH.FSMC_A12.0=FSMC_A12,18b-a2
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F103ZETx
SPI2.VirtualType=VM_MASTER
SH.FSMC_A6.0=FSMC_A6,18b-a2
PG2.Signal=FSMC_A12
TIM1.IPParameters=Channel-Output Compare1 CH1,Prescaler,Period,OCMode_1
PG4.Signal=FSMC_A14
RCC.PLLCLKFreq_Value=72000000
SH.FSMC_NWE.0=FSMC_NWE,Lcd1
PG0.Signal=FSMC_A10
SH.FSMC_D0_DA0.1=FSMC_D0,16b-d2
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_CRC_Init-CRC-false-HAL-true,4-MX_FSMC_Init-FSMC-false-HAL-true,5-MX_TIM1_Init-TIM1-false-HAL-true,6-MX_USART1_UART_Init-USART1-false-HAL-true,7-MX_SPI2_Init-SPI2-false-HAL-true
SH.FSMC_NWE.1=FSMC_NWE,Sram2
SH.FSMC_D0_DA0.0=FSMC_D0,16b-d1
RCC.ADCFreqValue=36000000
FSMC.ExtendedBusTurnAroundDuration1=0x01
SH.S_TIM1_CH1.ConfNb=1
USART1.IPParameters=VirtualMode
PB13.Signal=SPI2_SCK
PB15.Signal=SPI2_MOSI
PinOutPanel.RotationAngle=0
PE5.GPIOParameters=GPIO_Speed,PinState
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x1000
PB5.GPIOParameters=GPIO_Speed,PinState
Mcu.IP4=RCC
RCC.FCLKCortexFreq_Value=72000000
Mcu.IP5=SPI2
Mcu.IP2=FSMC
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
Mcu.IP3=NVIC
RCC.SDIOHCLKDiv2FreqValue=36000000
Mcu.IP0=CRC
Mcu.IP1=FREERTOS
TIM1.Prescaler=0x05
SH.FSMC_A15.ConfNb=1
SPI2.CLKPolarity=SPI_POLARITY_HIGH
SH.FSMC_A11.0=FSMC_A11,18b-a2
PF9.Locked=true
Mcu.UserConstants=
PB0.PinState=GPIO_PIN_RESET
SH.FSMC_A7.0=FSMC_A7,18b-a2
SH.FSMC_A11.ConfNb=1
Mcu.ThirdPartyNb=0
RCC.SDIOFreq_Value=72000000
RCC.HCLKFreq_Value=72000000
Mcu.IPNb=9
ProjectManager.PreviousToolchain=
PD4.Signal=FSMC_NOE
RCC.APB2TimFreq_Value=72000000
PB5.PinState=GPIO_PIN_SET
PB12.PinState=GPIO_PIN_SET
PF12.Signal=FSMC_A6
Mcu.Pin6=PF5
PD0.Signal=FSMC_D2_DA2
Mcu.Pin7=PF9
PD8.Signal=FSMC_D13_DA13
Mcu.Pin8=PF10
PE5.Signal=GPIO_Output
Mcu.Pin9=OSC_IN
OSC_OUT.Mode=HSE-External-Oscillator
SH.FSMC_A10.0=FSMC_A10,A10_1
PE1.Signal=FSMC_NBL1
FREERTOS.IPParameters=Tasks01,configTOTAL_HEAP_SIZE,FootprintOK
OSC_OUT.Signal=RCC_OSC_OUT
RCC.AHBFreq_Value=72000000
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_4
Mcu.Pin0=PE5
Mcu.Pin1=PF0
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PF1
Mcu.Pin3=PF2
SH.FSMC_D4_DA4.ConfNb=2
SH.FSMC_D12_DA12.ConfNb=2
Mcu.Pin4=PF3
Mcu.Pin5=PF4
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
SH.FSMC_D6_DA6.ConfNb=2
RCC.PLLMUL=RCC_PLL_MUL9
SH.FSMC_A16_CLE.ConfNb=1
SH.FSMC_NBL0.0=FSMC_NBL0,2ByteEnable2
SH.FSMC_A17_ALE.ConfNb=1
ProjectManager.FirmwarePackage=STM32Cube FW_F1 V1.8.0
MxDb.Version=DB.5.0.60
PB0.GPIOParameters=GPIO_Speed,PinState
SH.FSMC_D14_DA14.1=FSMC_D14,16b-d2
SH.FSMC_NOE.ConfNb=2
PE13.Signal=FSMC_D10_DA10
ProjectManager.BackupPrevious=false
SH.FSMC_D14_DA14.0=FSMC_D14,16b-d1
SH.FSMC_D10_DA10.0=FSMC_D10,16b-d1
SH.FSMC_A14.0=FSMC_A14,18b-a2
SH.FSMC_D10_DA10.1=FSMC_D10,16b-d2
PE9.Signal=FSMC_D6_DA6
PA14.Mode=Serial_Wire
PB14.Mode=Full_Duplex_Master
SH.FSMC_A0.0=FSMC_A0,18b-a2
PF11.Signal=GPIO_Output
SH.FSMC_D6_DA6.0=FSMC_D6,16b-d1
File.Version=6
SH.FSMC_D6_DA6.1=FSMC_D6,16b-d2
PF10.Locked=true
PE5.PinState=GPIO_PIN_SET
SPI2.CalculateBaudRate=9.0 MBits/s
SH.FSMC_D9_DA9.ConfNb=2
SH.FSMC_A8.0=FSMC_A8,18b-a2
PA8.Signal=S_TIM1_CH1
FSMC.BusTurnAroundDuration1=0x01
FSMC.BusTurnAroundDuration2=0x01
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
PF3.Signal=FSMC_A3
VP_FREERTOS_VS_CMSIS_V1.Mode=CMSIS_V1
PE10.Signal=FSMC_D7_DA7
SH.FSMC_D5_DA5.0=FSMC_D5,16b-d1
ProjectManager.HalAssertFull=false
PB0.Locked=true
VP_TIM1_VS_ClockSourceINT.Mode=Internal
FREERTOS.configTOTAL_HEAP_SIZE=30720
SH.FSMC_D5_DA5.1=FSMC_D5,16b-d2
ProjectManager.ProjectName=HAL_F103ZETx_Release
SH.FSMC_D4_DA4.1=FSMC_D4,16b-d2
SH.FSMC_D4_DA4.0=FSMC_D4,16b-d1
RCC.PLLMCOFreq_Value=36000000
SH.FSMC_A0.ConfNb=1
SH.FSMC_A8.ConfNb=1
Mcu.Package=LQFP144
PB1.Signal=GPIO_Output
SH.FSMC_A2.ConfNb=1
NVIC.TimeBase=TIM6_IRQn
SPI2.Mode=SPI_MODE_MASTER
SH.FSMC_D15_DA15.ConfNb=2
RCC.I2S2Freq_Value=72000000
FSMC.IPParameters=ExtendedMode1,AddressSetupTime1,DataSetupTime1,BusTurnAroundDuration1,ExtendedAddressSetupTime1,ExtendedDataSetupTime1,ExtendedBusTurnAroundDuration1,AddressSetupTime2,WriteOperation2,DataSetupTime2,BusTurnAroundDuration2
PD12.Signal=FSMC_A17_ALE
SH.FSMC_NBL1.0=FSMC_NBL1,2ByteEnable2
ProjectManager.ToolChainLocation=
SH.FSMC_D13_DA13.0=FSMC_D13,16b-d1
SH.FSMC_D14_DA14.ConfNb=2
NVIC.TimeBaseIP=TIM6
PA10.Signal=USART1_RX
FREERTOS.FootprintOK=true
SH.FSMC_D13_DA13.1=FSMC_D13,16b-d2
SH.FSMC_A13.0=FSMC_A13,18b-a2
SPI2.CLKPhase=SPI_PHASE_2EDGE
SH.FSMC_A13.ConfNb=1
PF5.Signal=FSMC_A5
SH.FSMC_A1.0=FSMC_A1,18b-a2
SH.FSMC_D3_DA3.1=FSMC_D3,16b-d2
PB5.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
SH.FSMC_D3_DA3.0=FSMC_D3,16b-d1
SH.FSMC_A9.0=FSMC_A9,18b-a2
PF14.Signal=FSMC_A8
RCC.APB1TimFreq_Value=72000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
SH.FSMC_D2_DA2.1=FSMC_D2,16b-d2
SH.FSMC_D2_DA2.0=FSMC_D2,16b-d1
SH.FSMC_NWE.ConfNb=2
SPI2.Direction=SPI_DIRECTION_2LINES
PF0.Signal=FSMC_A0
TIM1.Period=0xffff
PB13.Mode=Full_Duplex_Master
PE7.Signal=FSMC_D4_DA4
NVIC.USART1_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
SH.FSMC_D7_DA7.ConfNb=2
PD15.Signal=FSMC_D1_DA1
ProjectManager.CustomerFirmwarePackage=
SH.FSMC_A5.ConfNb=1
PG12.Signal=FSMC_NE4
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
FSMC.ExtendedAddressSetupTime1=0x01
ProjectManager.ProjectFileName=HAL_F103ZETx_Release.ioc
SH.FSMC_D12_DA12.0=FSMC_D12,16b-d1
SH.FSMC_D12_DA12.1=FSMC_D12,16b-d2
FREERTOS.Tasks01=xTask00,-3,1024,vUserTask00,Default,NULL,Dynamic,NULL,NULL;xTask01,-3,1024,vUserTask01,Default,NULL,Dynamic,NULL,NULL;xTask02,-3,1024,vUserTask03,Default,NULL,Dynamic,NULL,NULL
SH.FSMC_A2.0=FSMC_A2,18b-a2
PA10.Mode=Asynchronous
Mcu.PinsNb=62
FSMC.WriteOperation2=FSMC_WRITE_OPERATION_ENABLE
ProjectManager.NoMain=false
PG3.Signal=FSMC_A13
PG1.Signal=FSMC_A11
FSMC.ExtendedMode1=FSMC_EXTENDED_MODE_ENABLE
PG5.Signal=FSMC_A15
SH.FSMC_D9_DA9.1=FSMC_D9,16b-d2
SH.FSMC_NBL1.ConfNb=1
PG10.Mode=NorPsramChipSelect3_2
TIM1.OCMode_1=TIM_OCMODE_TOGGLE
SH.FSMC_A16_CLE.0=FSMC_A16,18b-a2
SH.FSMC_D8_DA8.ConfNb=2
PD1.Signal=FSMC_D3_DA3
ProjectManager.DefaultFWLocation=true
SH.FSMC_D9_DA9.0=FSMC_D9,16b-d1
PD9.Signal=FSMC_D14_DA14
PD5.Signal=FSMC_NWE
SH.FSMC_D11_DA11.ConfNb=2
PB12.Locked=true
ProjectManager.DeletePrevious=true
RCC.APB1CLKDivider=RCC_HCLK_DIV2
Mcu.Pin60=VP_SYS_VS_tim6
Mcu.Pin61=VP_TIM1_VS_ClockSourceINT
RCC.FamilyName=M
RCC.I2S3Freq_Value=72000000
PG10.Signal=FSMC_NE3
SH.FSMC_D8_DA8.0=FSMC_D8,16b-d1
SH.FSMC_D8_DA8.1=FSMC_D8,16b-d2
NVIC.TIM6_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
PB0.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PD10.Signal=FSMC_D15_DA15
PA13.Signal=SYS_JTMS-SWDIO
SH.FSMC_D13_DA13.ConfNb=2
VP_FREERTOS_VS_CMSIS_V1.Signal=FREERTOS_VS_CMSIS_V1
PA9.Mode=Asynchronous
Mcu.Pin59=VP_FREERTOS_VS_CMSIS_V1
SH.FSMC_A14.ConfNb=1
SH.S_TIM1_CH1.0=TIM1_CH1,Output Compare1 CH1
Mcu.Pin57=PE1
Mcu.Pin58=VP_CRC_VS_CRC
SH.FSMC_A3.0=FSMC_A3,18b-a2
ProjectManager.TargetToolchain=Makefile
SH.FSMC_A15.0=FSMC_A15,18b-a2
FSMC.DataSetupTime2=0x03
FSMC.DataSetupTime1=0x03
SH.FSMC_D5_DA5.ConfNb=2
Mcu.Pin51=PD4
SH.FSMC_A10.ConfNb=2
Mcu.Pin52=PD5
SPI2.CRCCalculation=SPI_CRCCALCULATION_DISABLE
Mcu.Pin50=PD1
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
Mcu.Pin55=PB5
Mcu.Pin56=PE0
Mcu.Pin53=PG10
Mcu.Pin54=PG12
SH.FSMC_A3.ConfNb=1
PA9.Signal=USART1_TX
VP_TIM1_VS_ClockSourceINT.Signal=TIM1_VS_ClockSourceINT
PB5.Locked=true
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler,CLKPolarity,CLKPhase,CRCCalculation
PF2.Signal=FSMC_A2
OSC_IN.Signal=RCC_OSC_IN
RCC.USBFreq_Value=72000000
PE11.Signal=FSMC_D8_DA8
Mcu.Pin48=PA14
PB12.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
Mcu.Pin49=PD0
PB1.Locked=true
Mcu.Pin46=PA10
Mcu.Pin47=PA13
PB14.Signal=SPI2_MISO
SH.FSMC_A7.ConfNb=1
Mcu.Pin40=PG2
Mcu.Pin41=PG3
SH.FSMC_D7_DA7.1=FSMC_D7,16b-d2
Mcu.Pin44=PA8
SH.FSMC_D7_DA7.0=FSMC_D7,16b-d1
Mcu.Pin45=PA9
FSMC.ExtendedDataSetupTime1=0x0f
Mcu.Pin42=PG4
board=custom
Mcu.Pin43=PG5
PG12.Mode=NorPsramChipSelect4_1
SH.FSMC_D0_DA0.ConfNb=2
ProjectManager.LastFirmware=true
PB15.Mode=Full_Duplex_Master
SH.FSMC_D3_DA3.ConfNb=2
RCC.VCOOutput2Freq_Value=8000000
VP_SYS_VS_tim6.Signal=SYS_VS_tim6
RCC.APB2Freq_Value=72000000
PE14.Signal=FSMC_D11_DA11
PE15.Signal=FSMC_D12_DA12
MxCube.Version=5.6.0
Mcu.Pin37=PD12
Mcu.Pin38=PD14
SH.FSMC_A10.1=FSMC_A10,18b-a2
Mcu.Pin35=PD10
PE8.Signal=FSMC_D5_DA5
Mcu.Pin36=PD11
PF10.Signal=GPIO_Output
Mcu.Pin39=PD15
Mcu.Pin30=PB13
SH.FSMC_A4.0=FSMC_A4,18b-a2
PF11.Locked=true
Mcu.Pin33=PD8
Mcu.Pin34=PD9
Mcu.Pin31=PB14
Mcu.Pin32=PB15
SH.FSMC_A4.ConfNb=1
PF15.Signal=FSMC_A9
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PF13.Signal=FSMC_A7
PE5.Locked=true
PF1.Signal=FSMC_A1
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreqValue,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FSMCFreq_Value,FamilyName,HCLKFreq_Value,I2S2Freq_Value,I2S3Freq_Value,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,PLLMUL,PLLSourceVirtual,SDIOFreq_Value,SDIOHCLKDiv2FreqValue,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USBFreq_Value,VCOOutput2Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F103Z(C-D-E)Tx
PE0.Signal=FSMC_NBL0
PE12.Signal=FSMC_D9_DA9
Mcu.Pin26=PE13
Mcu.Pin27=PE14
Mcu.Pin24=PE11
ProjectManager.UnderRoot=false
Mcu.Pin25=PE12
SH.FSMC_A17_ALE.0=FSMC_A17,18b-a2
Mcu.IP8=USART1
NVIC.TIM1_CC_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
Mcu.Pin28=PE15
PD14.Signal=FSMC_D0_DA0
Mcu.IP6=SYS
Mcu.Pin29=PB12
RCC.FSMCFreq_Value=72000000
Mcu.IP7=TIM1
ProjectManager.CoupleFile=true
RCC.SYSCLKFreq_VALUE=72000000
Mcu.Pin22=PE9
PB5.Signal=GPIO_Output
SH.FSMC_A6.ConfNb=1
Mcu.Pin23=PE10
RCC.TimSysFreq_Value=72000000
Mcu.Pin20=PE7
Mcu.Pin21=PE8
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
OSC_IN.Mode=HSE-External-Oscillator
PD11.Signal=FSMC_A16_CLE
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=6
SH.FSMC_D15_DA15.1=FSMC_D15,16b-d2
SH.FSMC_D15_DA15.0=FSMC_D15,16b-d1
PA14.Signal=SYS_JTCK-SWCLK
ProjectManager.HeapSize=0x500
Mcu.Pin15=PF13
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.Pin16=PF14
SH.FSMC_D11_DA11.1=FSMC_D11,16b-d2
TIM1.Channel-Output\ Compare1\ CH1=TIM_CHANNEL_1
Mcu.Pin13=PF11
SH.FSMC_D11_DA11.0=FSMC_D11,16b-d1
Mcu.Pin14=PF12
SH.FSMC_NOE.1=FSMC_NOE,Sram2
Mcu.Pin19=PG1
SH.FSMC_NOE.0=FSMC_NOE,Lcd1
SH.FSMC_A12.ConfNb=1
ProjectManager.ComputerToolchain=false
PF9.Signal=GPIO_Output
Mcu.Pin17=PF15
SH.FSMC_D2_DA2.ConfNb=2
Mcu.Pin18=PG0
SH.FSMC_D1_DA1.ConfNb=2
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
SH.FSMC_A5.0=FSMC_A5,18b-a2
Mcu.Pin11=PB0
Mcu.Pin12=PB1
Mcu.Pin10=OSC_OUT
PE5.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
SH.FSMC_NBL0.ConfNb=1
PF4.Signal=FSMC_A4
RCC.APB1Freq_Value=36000000
VP_CRC_VS_CRC.Mode=CRC_Activate
PB0.Signal=GPIO_Output
ProjectManager.DeviceId=STM32F103ZETx
PB12.GPIOParameters=GPIO_Speed,PinState
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=0
SH.FSMC_A9.ConfNb=1
SH.FSMC_A1.ConfNb=1
SH.FSMC_D10_DA10.ConfNb=2
